USE UniversityDBExtended;
GO

INSERT INTO Specialty
VALUES
('Game Development'),
('Computer Engineering'),
('Informatics'),
('Industrial Electronics');
GO

INSERT INTO [Group]
VALUES
('ITI-11', 1),
('ITP-21', 2),
('IP-31', 3),
('PE-41', 4);
GO

INSERT INTO [Subject]
VALUES
('Neural Networks'),
('OOP'),
('Computer Graphics'),
('Сomputer Networks');
GO

INSERT INTO Student
VALUES
('Святослав','Яровой', 'Романович', 'Муж', '2000-12-14', 1),
('Яромир ','Борисенко', 'Владимирович', 'Муж', '2000-10-03', 2),
('Абрам','Желиба', 'Дмитриевич', 'Муж', '2000-12-05', 1),
('Юлий','Селиверстов', 'Викторович', 'Муж', '1997-11-03', 1),
('Устин','Выговский', 'Богданович', 'Муж', '1999-12-06', 4),
('Шерлок','Воробьёв', 'Васильевич', 'Муж', '1999-12-29', 3),
('Болеслав','Якушев', 'Анатолиевич', 'Муж', '1998-06-11', 2),
('Эдуард','Каськив',  'Борисович', 'Муж', '1999-02-18', 2),
('Болеслав', 'Яценюк', 'Петрович', 'Муж', '2001-01-24', 3),
('Чарльз', 'Зуев', 'Петрович', 'Муж', '2000-09-10', 4);
GO

INSERT INTO Examiner
VALUES
('Илья', 'Воробьёв', 'Васильевич'),
('Болеслав','Яровой', 'Анатолиевич'),
('Абрам','Каськив', 'Борисович'),
('Юлий', 'Селиверстов', 'Богданович'),
('Чарльз','Желиба', 'Романович');
GO

INSERT INTO Exam
VALUES
(1, '2020-01-19', 2, 8, 1),
(2, '2020-01-14', 2, 2, 1),
(1, '2020-06-11', 3, 9, 2),
(2, '2020-06-18', 4, 8, 3),
(3, '2020-06-17', 6, 7, 5),
(4, '2020-06-11', 6, 5, 3),
(4, '2020-06-12', 7, 3, 4),
(2, '2020-06-11', 8, 4, 2);
GO

INSERT INTO Assessment
VALUES
(1, '2020-01-19', 1, 'зач', 5),
(2, '2020-01-14', 2, 'незач', 5),
(1, '2020-06-11', 3, 'незач', 5),
(2, '2020-06-18', 4, 'зач', 3),
(3, '2020-06-17', 9, 'зач', 2),
(4, '2020-06-11', 6, 'незач', 1),
(2, '2020-06-11', 8, 'зач', 4);
GO